


/*

使用硬件SPI：
	STEP1: 使能硬件SPI，并按照提示修改SS引脚，和按照提示使用相应API
		#define SYSTEM_SPI1_ENABLE		1		//使能SPI1
	STEP2: 按照提示，加入驱动代码
	
	#define Max7219_regNum 5 //寄存器数量
	u8 i;
	
	//MAX7219寄存器的地址和要填入的数据
	u8 Max7219_adr_data[Max7219_regNum][2] = 
	{
		{0x09,0xFF},	//译码方式：BCD译码
		{0x0A,0x08},	//亮度  0x01-0x0f
		{0x0B,0x07},	//扫描界限；8个数码管显示
		{0x0C,0x01},	//掉电模式：0；普通模式：1
		{0x0F,0x00}		//显示测试：1；测试结束，正常显示：0
	};
	
	#define Max7219_ShowNum 8 //默认显示八个，否则改寄存器0x0B
	//默认8个数码管要显示的数据，在把显示部分程序放入到定时器中断中周期刷新时，只需修改这里即可刷新显示
	u8 Max7219_show_data[Max7219_ShowNum][2] =  
	{
		{0x01,0x08},					//1号数码管显示数字8
		{0x02,0x09 | 1<<7},				//2号数码管显示数字9并带小数点
		{0x03,0x0A},					//3号数码管显示数字-
		{0x04,0x0B},					//4号数码管显示数字E
		{0x05,0x0C},					//5号数码管显示数字H
		{0x06,0x0D},					//6号数码管显示数字L
		{0x07,0x0E},					//7号数码管显示数字P
		{0x08,0x07}						//8号数码管显示数字7
	};
	
	//寄存器设置，上电初始化序列
	for(i = 0;i < Max7219_regNum;i++)
	{
		SPI1_WriteByte_16Byte(Max7219_adr_data[i]);
	}
	
	//显示刷新部分，把以下函数放到定时器中断中，循环执行更新
	for(i = 0;i < Max7219_ShowNum;i++)
	{
		SPI1_WriteByte_16Byte(Max7219_show_data[i]);
	}
*/